[{"slug":"at-the-fork-virtual-reality","title":"At the Fork","tags":["user experience design","visual design"],"content":"<html><head></head><body><h1 id=\"at-the-fork\">At the Fork</h1>\n<ul>\n<li>user experience design</li>\n<li>visual design</li>\n</ul>\n<p><img src=\"images/at-the-fork-virtual-reality/screen-5.jpg\" alt=\"\"></p>\n</body></html>"},{"slug":"cat-merrick-studios","title":"Cat Merrick Studios","tags":["user experience design","visual design","front-end dev"],"content":"<html><head></head><body><h1 id=\"cat-merrick-studios\">Cat Merrick Studios</h1>\n<ul>\n<li>user experience design</li>\n<li>visual design</li>\n<li>front-end dev</li>\n</ul>\n<blockquote>\n<p><strong>Cat&#x2019;s Evaluation:</strong><br>&#x201C;I couldn&apos;t be happier. Expectations blown out of the water.&#x201D;  </p>\n</blockquote>\n<p>UI design in the high-fashion world is very complex. As Cat &#x2014; a super friendly, brilliant industrial designer who&#x2019;s breaking into the jewelry scene later this year &#x2014; explained to me, there is a very weird and nebulous line to balance between minimalism and usability. Sites are designed to be minimalist, sparse, and in some cases, outright confusing &#x2014; <em>on purpose.</em></p>\n<p>Utterly baffling for me, a UX designer, whose entire job is about making things <strong>easy</strong> to use. The initial market research for this project was a bizarro, Alice-in-Wonder-Land-style journey into a world that really hinges on the model of, &#x201C;If you have to ask [how it works], you can&#x2019;t afford it&#x201D; &#x2014; but the more I dug, the more I realized that minimalism and hidden features were really important brand signals to the kinds of customers who might buy out your entire line.</p>\n<p>I was totally hooked: Cat herself is warm, open, friendly, brimming with creativity and gusto and tech-industry-like disruptiveness. It&#x2019;s a huge part of her brand, her work, and her style. But the industry she&#x2019;s about to disrupt is stark, minimalist, and has a bit of a &#x201C;fuck you&#x201D; attitude to outsiders and those who don&#x2019;t immediately come across as &#x201C;one of them.&#x201D;</p>\n<p>How do you marry those two totally different dynamics in a single website? What an awesome and fascinating design challenge.</p>\n<p><img src=\"images/cat-merrick-studios/early-wireframe.png\" alt=\"\">\n<em>An early in-situ wireframe.</em></p>\n<h3 id=\"the-requirements\">The Requirements</h3>\n<ol>\n<li><p>Cat wanted to be able to showcase her products by type, but didn&#x2019;t want her shop to feel too sparse by splitting things up into groups.</p>\n</li>\n<li><p>She wanted the site to be easy to understand and navigate, but not feel out of place among websites that adhered to extreme minimalism, sometimes at the expense of what we both recognized as usability best practices.</p>\n</li>\n<li><p>She wanted to be able to use gifs and videos as the &#x201C;featured&#x201D; image for products, which is a feature Shopify doesn&#x2019;t support out of the box.</p>\n</li>\n<li><p>She wanted to have a password-protected wholesale version of some, but not all, of the products.</p>\n</li>\n<li><p>She needed to be able to maintain all of this on her own, quickly and easily through the Shopify CMS. If at all possible, I wanted to avoid giving her something else to have to log into.</p>\n</li>\n</ol>\n<h3 id=\"challenges\">Challenges</h3>\n<p>The first round of design included elements (above) with bold Geomanist font, dramatic diagonals, and interesting product photography. The basic elements of Cat&#x2019;s in-progress brand were there &#x2014; monochrome color scheme, focus on photography, geometric typeface &#x2014; but it wasn&#x2019;t quite right for her target audience. All of Cat&#x2019;s pieces are hand-designed and individually crafted, and the big-box-store UX patterns had far too much of a &#x201C;polished&#x201D; and commercial feel.</p>\n<p><img src=\"images/cat-merrick-studios/first-round.png\" alt=\"\">\n<em>On the right path, but ultimately too commercial.</em></p>\n<p>On the UX and tech side, we were playing a long game of technology tetris: Cat needed to have a password-protected wholesale section, with separate pricing structures for her products, and at some point in the future was considering opening up a home goods line. But until then, we wanted to make sure the site didn&#x2019;t feel empty or oddly organized. </p>\n<p>For non-bulk buyers, was a &#x201C;wholesale&#x201D; nav item distracting? What was the best way to organize products into categories and subcategories, and what was the best way to accomplish that in Shopify (which, we discovered, has significant security limitations when pulling product info via AJAX)? Because Cat was simultaneously designing and creating new products while we were designing and prototyping the site, the information architecture quickly became a sort of &#x201C;chicken-and-egg&#x201D; problem.</p>\n<p><img src=\"images/cat-merrick-studios/screenshot-2.png\" alt=\"\"></p>\n<h3 id=\"solutions\">Solutions</h3>\n<p>Ultimately, we settled on a single-page design for the jewelry collection, split into sections by Shopify sub-collections. This felt like the best of both worlds: show the user all of Cat&#x2019;s products to keep the page feeling full, but maintain organization and structure. We tried a few different iterations of &#x201C;filters&#x201D; by various product attributes, but ultimately, there just weren&#x2019;t enough products to filter by and they felt distracting. To keep load times down, I implemented some AJAX to dynamically load the next section as the user scrolled.</p>\n<p>Visually, we found our mark with Avenir Next, which had just the right amount of structure to feel classy without feeling overly minimalist (like straight Helvetica) or too commercial (like Geomanist). Thick black lines and bold black buttons kept key calls-to-action prominent and top-of-mind. Everything else was stripped down to give more prominence to the product photography (all screenshots are using sample photos).</p>\n<p>I was also able to add metafields to Shopify products so that Cat could upload gifs, embed YouTube links, add &#x201C;product stories&#x201D; &#x2014; about the story behind each piece &#x2014; and dictate different photos for different parts of the site.</p>\n<p>And to keep time-on-site up, I added another &#x201C;infinite-scroll&#x201D; feature to the single product page, plus some javascript to make the product information &#x201C;sticky&#x201D;:</p>\n<p><img src=\"images/cat-merrick-studios/ezgif-3-541a428016.gif\" alt=\"\"></p>\n<p>I&#x2019;m particularly excited about how this individual product page turned out: because of limitations on how Shopify makes product data available, it took some figuring to add infinite scroll to individual product pages. As it turns out, unless you want to create your own Shopify Admin app, front-end scripts don&#x2019;t have API access to product data &#x2014; trying to pass (clean) product data to a Vue component turned out to be way more complicated than was worth it, and  in the end, I switched the project back to jQuery:</p>\n<pre><code>function getNextProduct () {\n    // Only get next product once\n    tryLoadingNextProduct = false\n\n    /* We&apos;ve used Shopify&apos;s built in &quot;next product in collection&quot; feature\n    /* to add a hidden &lt;a&gt; tag at the bottom of the current product\n    /* Now, we just need to find that next product link on this page */\n    var nextProductLink = $(&apos;#next-product&apos;)\n\n    if (nextProductLink.length &gt; 0) {\n      // Okay Ajax, do your thing.\n      $.get({ url: nextProductLink.find(&apos;a&apos;).attr(&apos;href&apos;) }, function (data) {\n\n     // Find the product container on the next page\n        var next = $(data).find(&apos;.product-container&apos;)\n        var id = next.data(&apos;product-id&apos;)\n        var nextTitle = $(`&lt;div class=&apos;next-product-header&apos;&gt;Next:&amp;nbsp;&lt;/div&gt;`)\n\n        // Append it to this page\n        nextTitle.insertAfter(&apos;.product-container:last-of-type&apos;)\n        nextTitle.append($(data).find(&apos;h1#product-title&apos;).html())\n\n        next.insertAfter(&apos;.next-product-header:last-of-type&apos;)\n\n        nextProductLink.removeAttr(&apos;id&apos;) // You&apos;re not the &quot;next&quot; anymore, link.\n\n        layoutProductImages() // Lay out images again\n\n        // Stickify the menu container\n        if ($(window).width() &gt; 768) {\n          $(&apos;.product-container:last-of-type .product-description-main&apos;).stick_in_parent()\n        }\n\n        // Swap out gross selectboxes for pretty ones\n        $(&apos;.selectify&apos;).select2({ width: &apos;auto&apos; })\n\n        $(&apos;select&apos;).on(&apos;select2:select&apos;, function(event) {\n          onSelectChange($(this))\n        })\n\n        getProductData(id)\n\n        tryLoadingNextProduct = true\n\n      })\n    }\n\n  }\n</code></pre><p>Ultimately, I think what we built is going to be a huge success, and I can&#x2019;t wait to see her line launch later this year.</p>\n</body></html>"},{"slug":"free-together","title":"Free Together","tags":[],"content":"<html><head></head><body><h1 id=\"free-together\">Free Together</h1>\n</body></html>"},{"slug":"my-magic-mud","title":"My Magic Mud","tags":[],"content":"<html><head></head><body><h1 id=\"my-magic-mud\">My Magic Mud</h1>\n</body></html>"},{"slug":"social-evolution","title":"Social Evolution","tags":["user experience design","visual design","front-end dev"],"content":"<html><head></head><body><h1 id=\"social-evolution\">Social Evolution</h1>\n<p>Finished Website: <a href=\"http://social-evolution.com/\">Social Evolution</a></p>\n<ul>\n<li>user experience design</li>\n<li>visual design</li>\n<li>front-end dev</li>\n</ul>\n<p><img src=\"images/social-evolution/prospectus.png\" alt=\"\"></p>\n<h2 id=\"the-requirements\">The Requirements</h2>\n<ol>\n<li><p>A front-facing website that shows (and tells) the story of a disruptive, tech-focused non-profit that&#x2019;s about to change the world.</p>\n</li>\n<li><p>A back-end, invite-only web app that gives users access to a curated list of projects they might be interested in supporting.</p>\n</li>\n<li><p>Customizable everything: colors, font-positioning, images, blend mode, blend intensity.</p>\n</li>\n<li><p>Fast, quickly deployable, and easy for non-tech users to edit &amp; add content to.</p>\n</li>\n</ol>\n</body></html>"},{"slug":"texas-millennial-institute","title":"Texas Millennial Institute","tags":["visual design","branding"],"content":"<html><head></head><body><h1 id=\"texas-millennial-institute\">Texas Millennial Institute</h1>\n<ul>\n<li>visual design</li>\n<li>branding</li>\n</ul>\n<p>There are a ton of public policy organizations that want to talk to Millennials; very few are actually <em>run</em> by millennials. When the founders of the Texas Millennial Institute decided they wanted to create their own non-profit and forge their own path (complete with a new brand identity), they knew one thing for certain: they didn&#x2019;t want their audience to think they were boring, stale, or, worst of all, <em>old</em>. </p>\n<p><img src=\"images/texas-millennial-institute/screenshot.png\" alt=\"\">\n<em>TMI&#x2019;s first website, with their old logo.</em></p>\n<p>One of the interesting challenges of working with non-profit organizations is that they have to serve two masters: their audience, and their donors. For TMI, this meant their branding needed to be playful, fun, and genuinely &#x201C;Millennial&#x201D; &#x2014; but it also needed to signal that they were the kind of organization that was serious and professional enough to be trusted with grants and donations. Balancing this line was especially important for TMI, whose entire organization is run by younger officers, and whose mission is to host events that genuinely engage with issues that Texan millennials care about.</p>\n<p><img src=\"images/texas-millennial-institute/SocialProfile-Blue.jpg\" alt=\"\"></p>\n<p>After a few back-and-forths over how to balance the line between professionalism and genuineness, I presented the TMI team with this mark &#x2014; a playfully rounded Texas icon, with a chat bubble coming from El Paso. The light blue and rounded features keeps it feeling young and exciting, but the clean shapes and monotone color palette keeps the brand from feeling messy or disorganized.</p>\n<p>We tried a number of different typefaces &#x2014; from Proxima Nova, to a grainy, almost comic-book style sans &#x2014; and settled on Brandon Grotesque. Geometric and structured, but with a hint of rounded corners, I think Brandon balances out TMI&#x2019;s competing mandates particularly well. </p>\n<p>In TMI&#x2019;s extended branding kit, the mark becomes extremely flexible: it&#x2019;s recognizably &#x201C;TMI&#x201D; even when the chat bubble is filled with other text, like a teaser for their latest events&#x2019; content, or an ad for their organization&#x2019;s mailing list. </p>\n<p>A few examples of extended branding that I produced for them:</p>\n<p><img src=\"images/texas-millennial-institute/hero-photo.png\" alt=\"\">\n<em>An ad for TMI&#x2019;s new brand.</em></p>\n<p><img src=\"images/texas-millennial-institute/immigration-fb-desktopHD.jpg\" alt=\"\">\n<em>An event banner for a summit on Immigration Policy.</em></p>\n</body></html>"}]